Revit 2024 API
LoadCase.IsLoadCaseSubcategoryId Method
 Checks whether provided element ID refer to subcategory of Structural Load Cases (OST_LoadCases) category - one of built-in or user defined.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsLoadCaseSubcategoryId(
	ElementId loadCaseSubcategoryId
)
Visual Basic
Public Function IsLoadCaseSubcategoryId ( _
	loadCaseSubcategoryId As ElementId _
) As Boolean
Visual C++
public:
bool IsLoadCaseSubcategoryId(
	ElementId^ loadCaseSubcategoryId
)
Parameters
loadCaseSubcategoryId
Type: Autodesk.Revit.DB.ElementId
 The ID to check.
Return Value
 True if the ID refers to load case category element, false otherwise.
Remarks
 Built-in structural Load Cases (OST_LoadCases) subcategories are: OST_LoadCasesDeadOST_LoadCasesLiveOST_LoadCasesWindOST_LoadCasesSnowOST_LoadCasesRoofLiveOST_LoadCasesAccidentalOST_LoadCasesTemperatureOST_LoadCasesSeismic
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace